print("19 המשפטים הבאים יעזרו לכם לכתוב תוכנות פייתון בצורה הטובה ביותר:")


print("""יפה יותר טוב ממכוער.
מפורש טוב יותר מכל משתמע.
פשוט עדיף על מורכב.
מורכב עדיף על מסובך.
ישר טובה יותר מקינון.
דליל עדיף על צפיפות.
הקריאות נחשבת.
מקרים מיוחדים אינם מספיק מיוחדים כדי להפר את הכללים.
למרות שהפרקטיות מנצחת את הטוהר.
שגיאות לעולם לא צריכות לעבור בשקט.
אלא אם כן הושתקו במפורש.
אל מול העמימות, סרב לפיתוי לנחש.
צריכה להיות דרך אחת - ורצוי רק דרך אחת ברורה לעשות זאת.
למרות שדרך זו אולי לא תהיה ברורה בהתחלה אלא אם כן אתה הולנדי.
עכשיו טוב יותר מאשר לעולם.
למרות שלעולם לא טוב יותר מ * ממש * עכשיו.
אם קשה להסביר את היישום, זה רעיון רע.
אם קל להסביר את היישום, יתכן וזה רעיון טוב.
מרחבי שמות הם רעיון מצוין - בואו נעשה יותר כאלה!""")